# 14 fields
prod_feat_flat_fields = [
    '想像一下AI陪伴能幫你/妳回答超多問題了。你/妳比較想知道的環保資訊是哪些? (買東西先查看產品的運輸距離（是不是當地食品）)',
    '想像一下AI陪伴能幫你/妳回答超多問題了。你/妳比較想知道的環保資訊是哪些? (買東西先查看公司生產過程多環保)',
    '想像一下AI陪伴能幫你/妳回答超多問題了。你/妳比較想知道的環保資訊是哪些? (買東西先查看公司工人的員工福利多好)',
    '想像一下AI陪伴能幫你/妳回答超多問題了。你/妳比較想知道的環保資訊是哪些? (投資前查看AI摘要的消費者對公司環保的評論)',
    '想像一下AI陪伴能幫你/妳回答超多問題了。你/妳比較想知道的環保資訊是哪些? (用社交網絡認識其他環保的同學)',
    '想像一下AI陪伴能幫你/妳回答超多問題了。你/妳比較想知道的環保資訊是哪些? (買東西先了解哪些產品污染最嚴重，以便避免它們)',
    '想像一下AI陪伴能幫你/妳回答超多問題了。你/妳比較想知道的環保資訊是哪些? (每個月查看我自己的環保分數報告（了解我用錢的方式多環保）)',
    '想像一下AI陪伴能幫你/妳回答超多問題了。你/妳比較想知道的環保資訊是哪些? (買東西先尋找有機產品)',
    '想像一下AI陪伴能幫你/妳回答超多問題了。你/妳比較想知道的環保資訊是哪些? (跟我的AI幫手討論環保問題)',
    '想像一下AI陪伴能幫你/妳回答超多問題了。你/妳比較想知道的環保資訊是哪些? (投資前查看公司的環保認證和生態評分)',
    '想像一下AI陪伴能幫你/妳回答超多問題了。你/妳比較想知道的環保資訊是哪些? (如何讓我支持的公司更環保)',
    '想像一下AI陪伴能幫你/妳回答超多問題了。你/妳比較想知道的環保資訊是哪些? (買東西先了解我吃的動物性食品，動物的生活環境)',
    '想像一下AI陪伴能幫你/妳回答超多問題了。你/妳比較想知道的環保資訊是哪些? (老實說我對任何環保資訊都沒有太多興趣)',
    '想像一下AI陪伴能幫你/妳回答超多問題了。你/妳比較想知道的環保資訊是哪些? (投資前比較公司的環保表現)'
]