
simple_fields = {
    '購物習慣': [
        '如果你/妳懷疑你/妳要買的番茄可能是由強迫勞工（現代奴隸）採摘的，你/妳仍然會買它嗎？',
        '你/妳關心食安嗎？',
        '你/妳7年內買車嗎？🚘',
        '你/妳7年內買房嗎？🏡',
        '你/妳購物時知道產品環保嗎？',
        '你/妳覺得認證環保的公司更好嗎？',
        '你/妳支持肉稅嗎？',
        '你/妳關心食用雞的生活嗎？',
        '你/妳避免吃肉嗎？'
    ],
    '存錢和投資習慣': [
        '你/妳會對金錢感到焦慮嗎？',
        '你/妳會對金錢很節儉嗎？',
        '你/妳會經常存錢嗎？',
        '你/妳對自己的財務知識滿意嗎？',
        '你/妳選哪個投資？',
        '你/妳投資會考慮環保嗎？'
    ],
    '台灣的經濟': [
        '你/妳覺得台灣的經濟目標是增長嗎？',
        '你/妳覺台灣的得環境退化是台灣的經濟增長的前提嗎？',
        '你/妳覺得台灣的經濟增長有助於保護環境嗎？',
        '你/妳覺得經濟能不排CO2也增長嗎？',
        '你/妳覺得經濟增長有物質限制嗎？'
    ],
    'AI使用習慣': [
        '你/妳會每天都用AI嗎？',
        '你/妳會信任AI嗎？',
        '你/妳想要AI有個造型嗎？',
    ],
    '台灣的大自然': [
        '你/妳喜歡待在大自然嗎？',
        '你/妳擔心氣候變化嗎？',
        '你/妳對環境污染情況會感到焦慮嗎？',
        '你/妳知道許多植物和動物的名字嗎？',
        '你/妳感覺自己和大自然很接近嗎？'
    ],
    '環保習慣': [
        '你/妳努力實踐低碳生活嗎？',
        '你/妳想做更多環保事嗎？',
        '你/妳對環境相關政治議題有興趣嗎？',
        '你/妳今年（2023年）搭飛機幾次？✈️',
        '你/妳信任碳排放抵消額度嗎？',
        '你/妳的環保行動對環境保護有效果嗎？'
    ],
    '學習環境': [
        '你/妳得自己對新觀念開放嗎？',
        '你/妳的大學對可環保性支持嗎？'
    ]
}
