txt_fields_by_category = {
    '購物習慣': [
        '你/妳會買哪一種番茄？',
        '你/妳會買哪種雞蛋？',
        '你/妳買哪種牛奶？',
        '你/妳有信任的品牌嗎？',
        '你/妳有沒有抵制過某公司？',
        '為什麼抵制？',
    ],
    '存錢和投資習慣': [
        '你/妳對自己的財務知識滿意嗎？',
        '你/妳覺得目前有任何投資嗎？',
        '你/妳有投資經驗如何？',
        '你/妳選哪個投資？',
    ],
    '台灣的經濟': [
        '你/妳覺得台灣的經濟目標是增長嗎？',
        '你/妳覺台灣的得環境退化是台灣的經濟增長的前提嗎？',
        '你/妳覺得台灣的經濟增長有助於保護環境嗎？',
        '你/妳覺得經濟能不排CO2也增長嗎？',
        '你/妳覺得經濟增長有物質限制嗎？'
    ],
    'AI使用習慣': [
        '你/妳會每天都用AI嗎？',
        '你/妳會信任AI嗎？',
        '你/妳想要AI扮什麼角色？',
        '你/妳想要AI有個造型嗎？',
        '你/妳喜歡如何與AI溝通？'
    ],
    '台灣的大自然': [
        '你/妳喜歡待在大自然嗎？',
        '你/妳擔心氣候變化嗎？',
        '你/妳對環境污染情況會感到焦慮嗎？',
        '你/妳知道許多植物和動物的名字嗎？',
        '你/妳覺得如何依照生態系對環境惡化的敏感度來排名？',
        '你/妳感覺自己和大自然很接近嗎？'
    ],
    '環保習慣': [
        '你/妳努力實踐低碳生活嗎？',
        '誰或什麼對你/妳環保態度影響最大的？',
        '你/妳想做更多環保事嗎？',
        '你/妳對環境相關政治議題有興趣嗎？',
        '你/妳怎去學校？',
        '你/妳今年（2023年）搭飛機幾次？✈️',
        '* 例如搭飛機會產生碳排放，可以購買碳抵消來種樹',
        '你/妳信任碳排放抵消額度嗎？',
        '想像一下AI陪伴能幫你/妳回答超多問題了。你/妳比較想知道的環保資訊是哪些?',
        '每月你/妳願意支付多少錢讓AI陪伴你/妳做更環保的財務決策？',
        '你/妳的環保行動對環境保護有效果嗎？'
    ],
    '學習環境': [
        '你/妳得自己對新觀念開放嗎？',
        '你/妳的大學對可環保性支持嗎？',
        '你/妳覺得大學生如何影響公司的可持續行為？'
    ]
}